/* eslint-disable no-tabs */
/*
 * @Author: hrd
 * @Date: 2022-06-24 18:51:48
 * @FilePath: \SanGuo\assets\script\game\battle\test\BattleTestData.ts
 * @Description:
 *
 */

// 战斗对象
// message FightUnit {
// 	int32 P = 1; //pos
// 	uint32 I = 2; //id
// 	int32 T = 3; //UnitType
// 	repeated IntAttr A = 4; //Int属性
// 	repeated StrAttr B = 5; //Str属性
// }
// // 战斗步骤
// message FightStep {
// 	int32 P = 1; //pos
// 	int32 S = 2; //skill
// 	int32 TP = 3; //target pos
// 	int32 EK = 4; //effect type
// 	int64 EV = 5; //effect value
// 	int32 R = 6; //round
// 	repeated FightStep FS = 7; //fightstep
// 	repeated SyncStep SS = 8; //syncstep
// 	int32 AT = 9; //FSion type
// }
// // 同步战斗步骤
// message SyncStep {
// 	repeated FightStep FS = 1; //fightstep
// 	repeated SyncStep SS = 2; //syncstep
// }
// // 战报
// message S2CBattlefieldReport {
// 	repeated FightUnit U = 1; //fightunit
// 	repeated FightStep FS = 2; //fightstep
// 	int64 Idx = 3; //战斗序号
// 	int32 T = 4; //战斗类型(副本类型)
// 	int64 P = 5; //战斗参数(副本关卡)
// 	int32 Win = 6; //是否战斗胜利：0失败，>0 胜利，并且代表星星
// 	int32 M = 7; //最大回合数
// }

export class BattleTestData {
    private static Instance: BattleTestData = null;

    private posList = [13, 28];
    public static get I(): BattleTestData {
        if (this.Instance == null) {
            this.Instance = new BattleTestData();
            this.Instance._init();
        }
        return this.Instance;
    }

    private _init() {
        //
    }

    public create(): void {
        const BattleData = new S2CBattlefieldReport();
        // add Unit
        for (let i = 0; i < this.posList.length; i++) {
            const p = this.posList[i];
            const u = this.createFightUnit(p);
            BattleData.U.push(u);
        }

        // add FightStep
    }

    private createFightUnit(pos: number): FightUnit {
        const u = new FightUnit();
        u.P = pos;
        u.I = 0;
        u.T = 0;
        return u;
    }

    private createFightStep() {
        //
        const BattleData = new S2CBattlefieldReport();
        BattleData.U = [];
    }
}

export const B = {
    U: [
        {
            P: 16,
            I: 3,
            T: 2,
            A: [
                {
                    K: 13004,
                },
                {
                    K: 13006,
                    V: '1',
                },
                {
                    K: 13003,
                    V: '2013',
                },
                {
                    K: 13001,
                    V: '150058362',
                },
                {
                    K: 13002,
                    V: '150058362',
                },
            ],
        },
        {
            P: 17,
            I: 3,
            T: 2,
            A: [
                {
                    K: 13004,
                },
                {
                    K: 13006,
                    V: '1',
                },
                {
                    K: 13003,
                    V: '2013',
                },
                {
                    K: 13001,
                    V: '150058362',
                },
                {
                    K: 13002,
                    V: '150058362',
                },
            ],
        },
        {
            P: 18,
            I: 3,
            T: 2,
            A: [
                {
                    K: 13004,
                },
                {
                    K: 13006,
                    V: '1',
                },
                {
                    K: 13003,
                    V: '2013',
                },
                {
                    K: 13001,
                    V: '150058362',
                },
                {
                    K: 13002,
                    V: '150058362',
                },
            ],
        },
        {
            P: 19,
            I: 3,
            T: 2,
            A: [
                {
                    K: 13004,
                },
                {
                    K: 13006,
                    V: '1',
                },
                {
                    K: 13003,
                    V: '2013',
                },
                {
                    K: 13001,
                    V: '150058362',
                },
                {
                    K: 13002,
                    V: '150058362',
                },
            ],
        },
        {
            P: 20,
            I: 3,
            T: 2,
            A: [
                {
                    K: 13004,
                },
                {
                    K: 13006,
                    V: '1',
                },
                {
                    K: 13003,
                    V: '2013',
                },
                {
                    K: 13001,
                    V: '150058362',
                },
                {
                    K: 13002,
                    V: '150058362',
                },
            ],
        }, {
            P: 21,
            I: 3,
            T: 2,
            A: [
                {
                    K: 13004,
                },
                {
                    K: 13006,
                    V: '1',
                },
                {
                    K: 13003,
                    V: '2013',
                },
                {
                    K: 13001,
                    V: '150058362',
                },
                {
                    K: 13002,
                    V: '150058362',
                },
            ],
        }, {
            P: 22,
            I: 3,
            T: 2,
            A: [
                {
                    K: 13004,
                },
                {
                    K: 13006,
                    V: '1',
                },
                {
                    K: 13003,
                    V: '2013',
                },
                {
                    K: 13001,
                    V: '150058362',
                },
                {
                    K: 13002,
                    V: '150058362',
                },
            ],
        }, {
            P: 23,
            I: 3,
            T: 2,
            A: [
                {
                    K: 13004,
                },
                {
                    K: 13006,
                    V: '1',
                },
                {
                    K: 13003,
                    V: '2013',
                },
                {
                    K: 13001,
                    V: '150058362',
                },
                {
                    K: 13002,
                    V: '150058362',
                },
            ],
        }, {
            P: 24,
            I: 3,
            T: 2,
            A: [
                {
                    K: 13004,
                },
                {
                    K: 13006,
                    V: '1',
                },
                {
                    K: 13003,
                    V: '2013',
                },
                {
                    K: 13001,
                    V: '150058362',
                },
                {
                    K: 13002,
                    V: '150058362',
                },
            ],
        }, {
            P: 25,
            I: 3,
            T: 2,
            A: [
                {
                    K: 13004,
                },
                {
                    K: 13006,
                    V: '1',
                },
                {
                    K: 13003,
                    V: '2013',
                },
                {
                    K: 13001,
                    V: '150058362',
                },
                {
                    K: 13002,
                    V: '150058362',
                },
            ],
        },

        {
            P: 28,
            I: 4,
            T: 1,
            A: [
                {
                    K: 2571,
                    V: '11100001',
                },
                {
                    K: 2572,
                    V: '12100001',
                },
                {
                    K: 2524,
                    V: '4',
                },
                {
                    K: 2531,
                    V: '10',
                },
                {
                    K: 2526,
                    V: '1',
                },
                {
                    K: 2528,
                    V: '2400509724',
                },
                {
                    K: 2570,
                    V: '10100002',
                },
                {
                    K: 13001,
                    V: '150058362',
                },
                {
                    K: 13002,
                    V: '150058362',
                },
            ],
            B: [
                {
                    K: 2525,
                    V: '拗口',
                },
            ],
        },

        {
            P: 1,
            I: 3,
            T: 2,
            A: [
                {
                    K: 13004,
                },
                {
                    K: 13006,
                    V: '1',
                },
                {
                    K: 13003,
                    V: '2013',
                },
                {
                    K: 13001,
                    V: '150058362',
                },
                {
                    K: 13002,
                    V: '150058362',
                },
            ],
        },
        {
            P: 2,
            I: 3,
            T: 2,
            A: [
                {
                    K: 13004,
                },
                {
                    K: 13006,
                    V: '1',
                },
                {
                    K: 13003,
                    V: '2013',
                },
                {
                    K: 13001,
                    V: '150058362',
                },
                {
                    K: 13002,
                    V: '150058362',
                },
            ],
        },
        {
            P: 3,
            I: 3,
            T: 2,
            A: [
                {
                    K: 13004,
                },
                {
                    K: 13006,
                    V: '1',
                },
                {
                    K: 13003,
                    V: '2013',
                },
                {
                    K: 13001,
                    V: '150058362',
                },
                {
                    K: 13002,
                    V: '150058362',
                },
            ],
        },
        {
            P: 4,
            I: 3,
            T: 2,
            A: [
                {
                    K: 13004,
                },
                {
                    K: 13006,
                    V: '1',
                },
                {
                    K: 13003,
                    V: '2013',
                },
                {
                    K: 13001,
                    V: '150058362',
                },
                {
                    K: 13002,
                    V: '150058362',
                },
            ],
        },
        {
            P: 5,
            I: 3,
            T: 2,
            A: [
                {
                    K: 13004,
                },
                {
                    K: 13006,
                    V: '1',
                },
                {
                    K: 13003,
                    V: '2013',
                },
                {
                    K: 13001,
                    V: '150058362',
                },
                {
                    K: 13002,
                    V: '150058362',
                },
            ],
        }, {
            P: 6,
            I: 3,
            T: 2,
            A: [
                {
                    K: 13004,
                },
                {
                    K: 13006,
                    V: '1',
                },
                {
                    K: 13003,
                    V: '2013',
                },
                {
                    K: 13001,
                    V: '150058362',
                },
                {
                    K: 13002,
                    V: '150058362',
                },
            ],
        }, {
            P: 7,
            I: 3,
            T: 2,
            A: [
                {
                    K: 13004,
                },
                {
                    K: 13006,
                    V: '1',
                },
                {
                    K: 13003,
                    V: '2013',
                },
                {
                    K: 13001,
                    V: '150058362',
                },
                {
                    K: 13002,
                    V: '150058362',
                },
            ],
        }, {
            P: 8,
            I: 3,
            T: 2,
            A: [
                {
                    K: 13004,
                },
                {
                    K: 13006,
                    V: '1',
                },
                {
                    K: 13003,
                    V: '2013',
                },
                {
                    K: 13001,
                    V: '150058362',
                },
                {
                    K: 13002,
                    V: '150058362',
                },
            ],
        }, {
            P: 9,
            I: 3,
            T: 2,
            A: [
                {
                    K: 13004,
                },
                {
                    K: 13006,
                    V: '1',
                },
                {
                    K: 13003,
                    V: '2013',
                },
                {
                    K: 13001,
                    V: '150058362',
                },
                {
                    K: 13002,
                    V: '150058362',
                },
            ],
        }, {
            P: 10,
            I: 3,
            T: 2,
            A: [
                {
                    K: 13004,
                },
                {
                    K: 13006,
                    V: '1',
                },
                {
                    K: 13003,
                    V: '2013',
                },
                {
                    K: 13001,
                    V: '150058362',
                },
                {
                    K: 13002,
                    V: '150058362',
                },
            ],
        },

        {
            P: 13,
            I: 2,
            T: 1,
            A: [
                {
                    K: 2531,
                    V: '10',
                },
                {
                    K: 2526,
                    V: '1',
                },
                {
                    K: 2528,
                    V: '2400509724',
                },
                {
                    K: 2570,
                    V: '10100002',
                },
                {
                    K: 2571,
                    V: '11100001',
                },
                {
                    K: 2572,
                    V: '12100001',
                },
                {
                    K: 2524,
                    V: '4',
                },
                {
                    K: 13001,
                    V: '150058362',
                },
                {
                    K: 13002,
                    V: '150058362',
                },
            ],
            B: [
                {
                    K: 2525,
                    V: '拗口',
                },
            ],
        },
    ],
    FS: [
        {
            AT: 1, // 技能行为
            P: 28, // 3号位发起攻击
            S: 106, // 使用技能id
            R: 1,
            ET: 1, // 执行类型 1=顺序 2=并发
            FS: [
                {
                    AT: 2, // 攻击行为
                    P: 28, // 3号位发起攻击
                    ET: 1, // 执行类型 1=顺序 2=并发
                    FS: [
                        {
                            AT: 4, // 受击行为
                            P: 28, // 号位发起攻击
                            TP: 3, // 号位被攻击
                            EK: 1, // 效果类型1 普攻
                            EV: 100, // 普攻伤害值 2000
                        },
                        {
                            AT: 4, // 受击行为
                            P: 28, // 号位发起攻击
                            TP: 3, // 号位被攻击
                            EK: 1, // 效果类型1 普攻
                            EV: 100, // 普攻伤害值
                        },
                        {
                            AT: 4, // 受击行为
                            P: 28, // 号位发起攻击
                            TP: 3, // 号位被攻击
                            EK: 3, // 效果类型1 普攻
                            EV: 100, // 普攻伤害值
                        },
                        {
                            AT: 4, // 受击行为
                            P: 28, // 号位发起攻击
                            TP: 3, // 号位被攻击
                            EK: 1, // 效果类型1 普攻
                            EV: 100, // 普攻伤害值
                        },
                    ],
                },
            ],
        },
        {
            AT: 1, // 技能行为
            P: 28, // 3号位发起攻击
            S: 30111, // 使用技能id
            R: 1,
            ET: 1, // 执行类型 1=顺序 2=并发
            FS: [
                {
                    AT: 2, // 攻击行为
                    P: 28, // 3号位发起攻击
                    ET: 2, // 执行类型 1=顺序 2=并发
                    FS: [
                        {
                            AT: 4, // 受击行为
                            P: 28, // 3号位发起攻击
                            TP: 4, // 18号位被攻击
                            ET: 2, // 执行类型 1=顺序 2=并发
                            FS: [
                                {
                                    AT: 4, // 受击行为
                                    P: 28, // 3号位发起攻击
                                    TP: 8, // 18号位被攻击
                                    EK: 1, // 效果类型1 普攻
                                    EV: 100, // 普攻伤害值
                                },
                            ],

                        },
                        {
                            AT: 4, // 受击行为
                            P: 28, // 3号位发起攻击
                            TP: 8, // 18号位被攻击
                            EK: 1, // 效果类型1 普攻
                            EV: 100, // 普攻伤害值
                            ET: 2, // 执行类型 1=顺序 2=并发
                            FS: [
                                {
                                    AT: 3, // buff行为
                                    P: 28, // 3号位发起攻击
                                    TP: 8, // 18号位被攻击
                                    EK: 1006, // 效果类型1006 buff
                                    EV: 1, // buff值
                                },
                            ],
                        },
                    ],
                },
            ],
        },
        {
            AT: 1, // 技能行为
            P: 28, // 3号位发起攻击
            S: 30111, // 使用技能id
            R: 2,
            ET: 1, // 执行类型 1=顺序 2=并发
            FS: [
                {
                    AT: 2, // 攻击行为
                    P: 28, // 3号位发起攻击
                    ET: 2, // 执行类型 1=顺序 2=并发
                    FS: [
                        {
                            AT: 4, // 受击行为
                            P: 28, // 3号位发起攻击
                            TP: 4, // 18号位被攻击
                            ET: 2, // 执行类型 1=顺序 2=并发
                            FS: [
                                {
                                    AT: 4, // 受击行为
                                    P: 28, // 3号位发起攻击
                                    TP: 8, // 18号位被攻击
                                    EK: 1, // 效果类型1 普攻
                                    EV: 100, // 普攻伤害值
                                },
                                {
                                    AT: 4, // 受击行为
                                    P: 28, // 3号位发起攻击
                                    TP: 9, // 18号位被攻击
                                    EK: 1, // 效果类型1 普攻
                                    EV: 100, // 普攻伤害值
                                },
                                {
                                    AT: 4, // 受击行为
                                    P: 28, // 3号位发起攻击
                                    TP: 4, // 18号位被攻击
                                    EK: 1, // 效果类型1 普攻
                                    EV: 100, // 普攻伤害值
                                },
                            ],

                        },
                        {
                            AT: 4, // 受击行为
                            P: 28, // 3号位发起攻击
                            TP: 8, // 18号位被攻击
                            EK: 1, // 效果类型1 普攻
                            EV: 100, // 普攻伤害值
                            ET: 2, // 执行类型 1=顺序 2=并发
                            FS: [
                                {
                                    AT: 3, // buff行为
                                    P: 28, // 3号位发起攻击
                                    TP: 8, // 18号位被攻击
                                    EK: 1006, // 效果类型1006 buff
                                    EV: 1, // buff值
                                },
                            ],
                        },
                    ],
                },
            ],
        },
        {
            AT: 1, // 技能行为
            P: 3, // 3号位发起攻击
            S: 102, // 使用技能id
            R: 3,
            ET: 1, // 执行类型 1=顺序 2=并发
            FS: [
                {
                    AT: 2, // 攻击行为
                    P: 3, // 3号位发起攻击
                    ET: 2, // 执行类型 1=顺序 2=并发
                    FS: [
                        {
                            AT: 4, // 受击行为
                            P: 3, // 号位发起攻击
                            TP: 18, // 号位被攻击
                            EK: 1, // 效果类型1 普攻
                            EV: 100, // 普攻伤害值 2000
                        },
                        {
                            AT: 4, // 受击行为
                            P: 3, // 号位发起攻击
                            TP: 16, // 号位被攻击
                            EK: 1, // 效果类型1 普攻
                            EV: 100, // 普攻伤害值
                        },
                        {
                            AT: 4, // 受击行为
                            P: 3, // 号位发起攻击
                            TP: 17, // 号位被攻击
                            EK: 1, // 效果类型1 普攻
                            EV: 100, // 普攻伤害值
                        },
                        {
                            AT: 4, // 受击行为
                            P: 3, // 号位发起攻击
                            TP: 19, // 号位被攻击
                            EK: 1, // 效果类型1 普攻
                            EV: 100, // 普攻伤害值
                        },
                    ],
                },
                {
                    AT: 2, // 攻击行为
                    P: 3, // 3号位发起攻击
                    ET: 2, // 执行类型 1=顺序 2=并发
                    FS: [
                        {
                            AT: 4, // 受击行为
                            P: 3, // 号位发起攻击
                            TP: 24, // 号位被攻击
                            EK: 1, // 效果类型1 普攻
                            EV: 100, // 普攻伤害值 2000
                        },
                        {
                            AT: 4, // 受击行为
                            P: 3, // 号位发起攻击
                            TP: 21, // 号位被攻击
                            EK: 1, // 效果类型1 普攻
                            EV: 100, // 普攻伤害值
                        },
                        {
                            AT: 4, // 受击行为
                            P: 3, // 号位发起攻击
                            TP: 22, // 号位被攻击
                            EK: 1, // 效果类型1 普攻
                            EV: 100, // 普攻伤害值 2000
                        },
                        {
                            AT: 4, // 受击行为
                            P: 3, // 号位发起攻击
                            TP: 23, // 号位被攻击
                            EK: 1, // 效果类型1 普攻
                            EV: 100, // 普攻伤害值
                        },
                        {
                            AT: 4, // 受击行为
                            P: 3, // 号位发起攻击
                            TP: 24, // 号位被攻击
                            EK: 3, // 效果类型1 普攻
                            EV: 1000000, // 普攻伤害值
                        },
                    ],
                },
            ],
        },
        {
            AT: 1, // 技能行为
            P: 28, // 3号位发起攻击
            S: 106, // 使用技能id
            R: 3,
            ET: 1, // 执行类型 1=顺序 2=并发
            FS: [
                {
                    AT: 2, // 攻击行为
                    P: 28, // 3号位发起攻击
                    ET: 2, // 执行类型 1=顺序 2=并发
                    FS: [
                        {
                            AT: 4, // 受击行为
                            P: 28, // 号位发起攻击
                            TP: 3, // 号位被攻击
                            EK: 1, // 效果类型1 普攻
                            EV: 100, // 普攻伤害值 2000
                        },
                        {
                            AT: 4, // 受击行为
                            P: 28, // 号位发起攻击
                            TP: 2, // 号位被攻击
                            EK: 1, // 效果类型1 普攻
                            EV: 100, // 普攻伤害值
                        },
                        {
                            AT: 4, // 受击行为
                            P: 28, // 号位发起攻击
                            TP: 1, // 号位被攻击
                            EK: 1, // 效果类型1 普攻
                            EV: 100, // 普攻伤害值
                        },
                        {
                            AT: 4, // 受击行为
                            P: 28, // 号位发起攻击
                            TP: 5, // 号位被攻击
                            EK: 1, // 效果类型1 普攻
                            EV: 100, // 普攻伤害值
                        },
                    ],
                },
                {
                    AT: 2, // 攻击行为
                    P: 28, // 3号位发起攻击
                    ET: 2, // 执行类型 1=顺序 2=并发
                    FS: [
                        {
                            AT: 4, // 受击行为
                            P: 28, // 号位发起攻击
                            TP: 6, // 号位被攻击
                            EK: 1, // 效果类型1 普攻
                            EV: 100, // 普攻伤害值 2000
                        },
                        {
                            AT: 4, // 受击行为
                            P: 28, // 号位发起攻击
                            TP: 7, // 号位被攻击
                            EK: 1, // 效果类型1 普攻
                            EV: 100, // 普攻伤害值
                        },
                        {
                            AT: 4, // 受击行为
                            P: 28, // 号位发起攻击
                            TP: 8, // 号位被攻击
                            EK: 1, // 效果类型1 普攻
                            EV: 100, // 普攻伤害值 2000
                        },
                        {
                            AT: 4, // 受击行为
                            P: 28, // 号位发起攻击
                            TP: 9, // 号位被攻击
                            EK: 1, // 效果类型1 普攻
                            EV: 100, // 普攻伤害值
                        },
                    ],
                },
            ],
        },
    ],
};
